conf/src/Catalogs/ЭП_ВидыУчетаВремени/ЭП_ВидыУчетаВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЭП_ВидыУчетаВремени</name>
  <predefined>
    <items>
      <name>НеЯвка</name>
      <description>Не явка</description>
    </items>
    <items>
      <name>Явка</name>
      <description>Явка</description>
    </items>
  </predefined>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>3</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КОД_ЗУП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

conf/src/CommonForms/ФормаЭлементаУчетВидаВремениЧасов/Module.bsl
#Область ОбработчикиСобытийФормы  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)   
	
	ВремяПредставление = Параметры.ВремяПредставление;
	ВремяПредставлениеПолученные = Параметры.ВремяПредставление;
	ПериодРегистрацииДень = Параметры.ПериодРегистрацииДень;
	Сотрудник = Параметры.Сотрудник;
	ВидУчетаВремени = Параметры.ВидУчетаВремени;
	Часы = Параметры.Время;  
	
КонецПроцедуры 

#КонецОбласти


#Область ОбработчикиКомандФормы  

&НаСервере
Процедура ЗаписатьНаСервере() 
	
	Если ВидУчетаВремени = Справочники.ЭП_ВидыУчетаВремени.Явка Тогда
		БуквенныйКод = "Я";
	ИначеЕсли ВидУчетаВремени = Справочники.ЭП_ВидыУчетаВремени.НеЯвка Тогда
		БуквенныйКод = "НЯ";
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭП_ВидыУчетаВремени.БуквенныйКод КАК БуквенныйКод
		|ИЗ
		|	Справочник.ЭП_ВидыУчетаВремени КАК ЭП_ВидыУчетаВремени
		|ГДЕ
		|	ЭП_ВидыУчетаВремени.Ссылка = &ВидУчетаВремени";
		
		Запрос.УстановитьПараметр("ВидУчетаВремени", ВидУчетаВремени);
		Запрос.УстановитьПараметр("НеЯвка", Справочники.ЭП_ВидыУчетаВремени.НеЯвка);
		Запрос.УстановитьПараметр("Явка", Справочники.ЭП_ВидыУчетаВремени.Явка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();	
		Выборка.Следующий();
		
		БуквенныйКод = Выборка.БуквенныйКод;  
	КонецЕсли;
	
	ПолеВремяУчета = СтрШаблон("%1; %2", БуквенныйКод, Часы);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();  
		
	//Проверка на наличие исправлений
	Исправление = ?(ВремяПредставлениеПолученные = ПолеВремяУчета, Ложь, Истина);  
		
    СтруктураВозврата = Новый Структура; 
	СтруктураВозврата.Вставить("Сотрудник", Сотрудник);
	СтруктураВозврата.Вставить("ПериодРегистрацииДень", ПериодРегистрацииДень);
	СтруктураВозврата.Вставить("ВидУчетаВремени", ВидУчетаВремени);
	СтруктураВозврата.Вставить("Часы", Часы);
	СтруктураВозврата.Вставить("ВремяПредставление", ПолеВремяУчета);
	СтруктураВозврата.Вставить("Исправление", Исправление);
	ОповеститьОВыборе(СтруктураВозврата);  
КонецПроцедуры   

#КонецОбласти
